export const Privacy_policy = `
본 사이트는 고객님의 개인정보를 중요시하며, "정보통신망 이용촉진 및 정보보호"에 관한 법률을 준수하고 있습니다.

본 사이트는 개인정보취급방침을 통하여 고객님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.

본 사이트는 개인정보취급방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.

ο 본 방침은 : 년월일 부터 시행됩니다.

■ 수집하는 개인정보의 항목

본 사이트는 회원가입, 상담, 서비스 신청 등등을 위해 아래와 같은 개인정보를 수집하고 있습니다.

ο 수집항목 : 이름 , 로그인ID , 비밀번호 , 휴대폰 번호, 이메일

ο 개인정보 수집방법 : 홈페이지(회원가입)

■ 개인정보의 수집 및 이용목적

본 사이트는 수집한 개인정보를 다음의 목적을 위해 활용합니다.

ο 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산

콘텐츠 제공 , 구매 및 요금 결제 , 물품배송 또는 청구지 등 발송

ο 회원 관리

회원제 서비스 이용에 따른 본인확인 , 개인 식별 , 불량회원의 부정 이용 방지와 비인가 사용 방지 가입 의사 확인 , 불만처리 등 민원처리 , 고지사항 전달

■ 개인정보의 보유 및 기간

본 사이트는 개인정보 수집 및 이용목적이 달성된 후에는 예외 없이 해당 정보를 지체 없이 파기합니다.

■ 개인정보의 파기 절차 및 방법

본 사이트는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체없이 파기합니다. 파기절차 및 방법은 다음과 같습니다.

ο 파기절차

회원님이 회원가입 등을 위해 입력하신 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기되어집니다. 별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되어지는 이외의 다른 목적으로 이용되지 않습니다.

ο 파기방법

- 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.

■ 개인정보 제공

본 사이트는 이용자의 개인정보를 원칙적으로 외부에 제공하지 않습니다. 다만, 아래의 경우에는 예외로 합니다.

- 이용자들이 사전에 동의한 경우
- 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우

■ 수집한 개인정보의 위탁

본 사이트는 고객님의 동의없이 고객님의 정보를 외부 업체에 위탁하지 않습니다. 향후 그러한 필요가 생길 경우, 위탁 대상자와 위탁 업무 내용에 대해 고객님에게 통지하고 필요한 경우 사전 동의를 받도록 하겠습니다.

■ 이용자 및 법정대리인의 권리와 그 행사방법

이용자 및 법정 대리인은 언제든지 등록되어 있는 자신 혹은 당해 만 14세 미만 아동의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다.

이용자 혹은 만 14세 미만 아동의 개인정보 조회,수정을 위해서는 ‘개인정보변경’(또는 ‘회원정보수정’ 등)을 가입해지(동의철회)를 위해서는 “회원탈퇴”를 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가 가능합니다. 혹은 개인정보관리책임자에게 서면, 전화 또는 이메일로 연락하시면 지체없이 조치하겠습니다. 귀하가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체없이 통지하여 정정이 이루어지도록 하겠습니다.

본 사이트는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 본 사이트가 수집하는 개인정보의 보유 및 이용기간”에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.

■ 개인정보에 관한 민원서비스

본 사이트는 고객의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부서 및 개인정보관리책임자를 지정하고 있습니다.

개인정보관리책임자 성명 : 최서영

전화번호 :

이메일 : 2023wowmarket@gmail.com

귀하께서는 본 사이트의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자 혹은 담당부서로 신고하실 수 있습니다. 본 사이트는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.

기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.

1.개인분쟁조정위원회 (www.1336.or.kr/1336)

2.정보보호마크인증위원회 (www.eprivacy.or.kr/02-580-0533~4)

3.대검찰청 인터넷범죄수사센터 (http://icic.sppo.go.kr/02-3480-3600)

4.경찰청 사이버테러대응센터 (www.ctrc.go.kr/02-392-0330)
`;

export const Notice = `
## 판매자 유의사항

판매자는 상품을 판매할 의사로 해당 상품을 '와우상점(이하 회사)'가 온라인으로 제공하는 양식에 맞추어 등록한 판매자 회원을 말합니다.

회사가 제공하는 서비스는 상품을 판매하고자 하는 판매자와 상품을 구매하고자 하는 구매자를 중개하는 통신판매중개서비스입니다. 회사가 제공하는 서비스는 이용자 간의 상품의 매매가 이루어질 수 있도록 온라인 거래장소를 제공하고, 작성한 입금 폼 확인을 용이하게 하는 것에 그치며, 상품 거래의 당사자가 되지 않습니다.

회사는 구매자에게 상품을 판매하지 않으며, 이용자 간 상품 거래가 이루어질 수 있도록 중개하고, 작성한 주문서 확인을 용이하게 하는 것에 그치며, 어떠한 경우에도 판매자 및 구매자를 대리하지 않습니다.

서비스에 등록된 판매상품과 상품내용은 판매자가 등록한 것으로서, 이와 관련한 사항 기타 상품의 주문배송 및 환불 등과 관련한 의무와 책임은 상품을 등록한 각 판매자에게 있습니다.

본 계약 및 업무와 관련하여 취득한 구매자의 결제 정보를 구매자의 사전 승인 없이 외부에 유출하여서는 안되며, 이를 위반할 경우 그로 인해 발생하는 손해에 대하여는 그 위반의 책임이 있는 자가 손해배상 기타 민∙형사상의 책임을 부담합니다.

판매자는 등록한 상품 중 구매자가 구매한 상품 등을 차질 없이 제공하여야 하며, 상품 등의 제공에 있어 관계 법령을 위반하거나 공공질서, 미풍양속을 저해하는 행위를 하여서는 아니됩니다.

판매자는 상품을 발송하기 전에 반드시 주문이 취소되었는지 최종 확인하여야 합니다. 또한 판매자는 발송 후 3일 이내에 회원이 주문한 상품을 수령할 수 있도록 조치해야 합니다.

판매자는 회사가 제공하는 서비스를 이용함에 있어서 『전자상거래법』(예시:공급서, 표시광고, 반품, 배송 등 통신판매에 관한 규정), 『전자거래기본법』(예시:소비자보호에 관한 규정), 『소비자기본법』(예시:사업자의 의무에 관한 규정), 『표시광고법』(예시:물품상세설명에 관련한 표시, 기재사항) 등 관련법령을 준수하여야 하며, 이에 반하여 구매자에게 불리한 거래 조건을 통지한 경우에도 관련 법령이 우선하고, 이 약관의 규정을 들어 관련법령 위반에 대한 면책을 주장할 수 없습니다.

판매자가 상품을 발송하지 않거나, 구매자의 연락을 받지 않는 경우, 구매자가 회사에 요청하면, 회사는 판매자가 판매하는 상품의 구매 청약을 한 구매자에게 이름, 전화번호, 이메일 등 신원정보를 제공할 수 있습니다. 다만, 회사는 이를 행하기 전, 판매자에게 연락하여 구매자의 연락을 받을 것을 3회 이상 요청하는 것을 원칙으로 하며, 판매자가 회사의 3회 이상의 요구에도 불구하고 상품 발송을 하지 않거나 연락을 받지 않는 경우 신원정보를 제공할 권리를 가집니다.

[부칙]
이 약관은 2023. 08. 24 부터 시행합니다.
공고일자 : 2023. 08. 24
시행일자 : 2023. 08. 24
`;
